---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.GetFilterCount
source: html/6792b334-203e-24ce-6813-4cfedbe07cd3.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.GetFilterCount Method

Gets the number of filters in this ScheduleDefinition.

## Syntax (C#)
```csharp
public int GetFilterCount()
```

## Returns
The number of filters.